# შემოატანინეთ მომხმარებელს ტავისი ასაკი  შემდეგ შეამოწმეთ 
# თუ ასაკი მეტია ან ტოლი ნულზე და ნაკლებია თვრამეტზე 
# დაბეწდეთ რომ ის არის ბავშვი. სხვა სემთხვევასი შემთხვევაში მეტია 
# ან ტოლი 18 ზე და ნაკლებია 50 ზე  დაბეჭდეთ რომ მომხმარებელი 
# არის ზრდასრული სხვა შემთხვევაში  დაუბეჭდეთ რომ ის არის ხანდაზმული.

number = int(input("please enter number: "))

if number >= 0 and number < 18:
    print("he is a childe")
elif number >= 18 and number < 50:
    print("you have enought age")
else:
   print("you are old")