# გამოიტანეთ while ციკლი 0-დან 20-ის ჩათვლით ყველა ლუწი რიცხვი.

i = 0

while i <= 20:
     print(i)
     i = i + 2

 # while ციკლით 10-დან 0-ის ჩათვლით გამოიტანეთ რიცხვები.


# i = 100

# while i >= 0:
#     print(i)
#     i = i - 1

#  # ერთიდან 100-ის ჩათვლით გამოიტანეთ რიცვთა ჯამი.

#     i = 1
#     sum = 0

#     while i <= 100:
#         sum = sum + i 
#         i = i + 1

#         print(sum)

#  # 50-დან 100-ის ჩათვლით არსებული 5 ის ჯერადების რიცხვტა ჯამი გამოიტანეთ.
#     #გამოიყენეთ while ციკლი.

#     # i = 50
#     # sum = 0

#     # while i <= 100:
#     #     sum = sum + i
#     #     i = i + 5

#     #     print(sum)



# # მომხმარებელს შემოატანინეთ რიცხვი და გაყავით იქამდე სანამ 2 ზე არ გაიყოფა და
# # გამოიტანეთ საბოლოო ვარიანტი.

# sum = int(input("please enter number: "))

# while sum % 2 == 0: 
#     print(sum)
#     sum = sum /2 
    